from ZmxyOL.nav.map_manager import Loc, Env
from AutoScriptor import *
from ZmxyOL.nav.envs.decorators import *

Env('村庄',(I("导航-奇闻录"), T("即将开启",box=Box(1146,128,118,400))))
Env('天庭',I("神兽森林",box=Box(320,439,382,255)))
Env('极北',I("极北背景"))
Env('地狱',I("地狱鬼城"))
Env('极寒深渊',I("极寒深渊背景"))
Env('极北村庄',I("极北-交易行"))
Env('仙盟',(I("公会-仓库"), I("公会-商店"), I("公会-议事楼"), I("公会-联盟"), I("公会-副本"), I("公会-任务"), I("公会-祭坛")))
Env('登录',(T("进入游戏"), T("已阅读并同意"), T("账号登录")))
Env('荒古万界',(T("万界穿梭")))

Loc('极北', '极北#-1', [I("极北背景-1")])
Loc('地狱', '地狱#1', [I("地狱背景-1")])
Loc('天庭', '天庭#1', [I("夺回昆仑山")])
Loc('天庭', '天庭#-2', [I("凌宵宝殿")])
Loc('天庭', '天庭#-1', [I("彩虹楼")])
Loc('天庭', '天庭#2', [I("兽神峰")])
Loc('天庭', '天庭#3', [I("八仙过海")])
Loc('天庭', '天庭#4', [I("龙宫")])

Loc(HAS_SHEZHI, "法相", [I("法相界面")])
Loc(HAS_SHEZHI, "背包", [I("背包背景")])
Loc('极北', '幽冥冰窟', [I("幽冥冰窟背景")])
Loc('极北村庄', '炼器师', [I('炼器炉')])